Keyrim/drone-stm32f4-mark0-software/Current_Software/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "../OS/system_d.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define PIN_LED_RED_Pin GPIO_PIN_13
#define PIN_LED_RED_GPIO_Port GPIOC
#define PIN_LED_GREEN_Pin GPIO_PIN_14
#define PIN_LED_GREEN_GPIO_Port GPIOC
#define PIN_LED_BLUE_Pin GPIO_PIN_15
#define PIN_LED_BLUE_GPIO_Port GPIOC
#define PIN_LED_RGB_1_Pin GPIO_PIN_0
#define PIN_LED_RGB_1_GPIO_Port GPIOC
#define PIN_V_BAT_Pin GPIO_PIN_1
#define PIN_V_BAT_GPIO_Port GPIOC
#define PIN_USER_1_Pin GPIO_PIN_2
#define PIN_USER_1_GPIO_Port GPIOC
#define PIN_USER_2_Pin GPIO_PIN_3
#define PIN_USER_2_GPIO_Port GPIOC
#define PIN_USER_4_Pin GPIO_PIN_1
#define PIN_USER_4_GPIO_Port GPIOA
#define PIN_CS_MICRO_SD_Pin GPIO_PIN_4
#define PIN_CS_MICRO_SD_GPIO_Port GPIOC
#define PIN_CURRENT_Pin GPIO_PIN_1
#define PIN_CURRENT_GPIO_Port GPIOB
#define PIN_CS_MPU_Pin GPIO_PIN_12
#define PIN_CS_MPU_GPIO_Port GPIOB
#define PIN_LED_RGB_2_Pin GPIO_PIN_9
#define PIN_LED_RGB_2_GPIO_Port GPIOC
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
